swt/prototyping.html
---
layout: page
title: Prototyping
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Prototyping</h2>
<div class="outline-text-2" id="text-1">
<p>
Ein Prototyp einer SW zeigt ausgeählte Eigenschaften des Zielprodukts im
praktischen Einsatz.
</p>

<p>
Arten von Prototypen:
</p>

<ul class="org-ul">
<li><i>evolutionärer Prototyp</i>: verwendet, um mit den Kunden inkrementell
und gemeinsam von einem initalen Entwurf zu einem nutzbaren System
kommen
</li>
<li><i>explorativer Prototyp</i>: verwendet, um bessere Kentniss der
Anforderungen zu gewinnen
</li>
<li><i>experimenteller Prototyp</i>: verwendet zur Erkundung technischer
Machbarkeit
</li>
</ul>

<p>
Taxonomie von Prototypen:
</p>

<ul class="org-ul">
<li><i>horizontaler Prototyp</i>: es werden nur spezifische Ebenen der
zukünftigen SW realisiert. Diese Ebenen werden i.d.R. im Prototyp
relativ vollständig realisiert. Explorative Protoypen sind i.d.R.
horizontale Prototypen.
</li>
<li><i>vertikaler Prototyp</i>: einzelne Aspekte einer SW werden über alle
Ebenen hinweg realisiert. Experimentelle Prototypen sind meist
vertikale Prototypen)
</li>
</ul>
</div>
</div>
